Breeder/OSIG/TurboMachinery/tutorials/rotorStatorInterfaces/mixingPlane/noRotationRS/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.01;

vertices
(
    (-0.51763809020504 1.931851652578137  0) 
    (-1.035276180410083 3.863703305156273 0) 
    (-0.34862297099063 3.984778792366982  0)
    (-0.17431148549532 1.992389396183491  0)
    ( 0.17431148549532 1.992389396183491  0)
    ( 0.34862297099063 3.984778792366982  0)
    ( 1.035276180410083 3.863703305156273 0)
    ( 0.51763809020504 1.931851652578137  0)
    (-0.51763809020504 1.931851652578137  1)
    (-1.035276180410083 3.863703305156273 1)
    (-0.34862297099063 3.984778792366982  1)
    (-0.17431148549532 1.992389396183491  1)
    ( 0.17431148549532 1.992389396183491  1)
    ( 0.34862297099063 3.984778792366982  1)
    ( 1.035276180410083 3.863703305156273 1)
    ( 0.51763809020504 1.931851652578137  1)
    (-0.51763809020504 1.931851652578137  1)
    (-1.035276180410083 3.863703305156273 1)
    (-0.34862297099063 3.984778792366982  1)
    (-0.17431148549532 1.992389396183491  1)
    ( 0.17431148549532 1.992389396183491  1)
    ( 0.34862297099063 3.984778792366982  1)
    ( 1.035276180410083 3.863703305156273 1)
    ( 0.51763809020504 1.931851652578137  1)
    (-0.51763809020504 1.931851652578137  1.3)
    (-1.035276180410083 3.863703305156273 1.3)
    (-0.34862297099063 3.984778792366982  1.3)
    (-0.17431148549532 1.992389396183491  1.3)
    ( 0.17431148549532 1.992389396183491  1.3)
    ( 0.34862297099063 3.984778792366982  1.3)
    ( 1.035276180410083 3.863703305156273 1.3)
    ( 0.51763809020504 1.931851652578137  1.3)
    (-0.51763809020504 1.931851652578137  1.6)
    (-1.035276180410083 3.863703305156273 1.6)
    (-0.34862297099063 3.984778792366982  1.6)
    (-0.17431148549532 1.992389396183491  1.6)
    ( 0.17431148549532 1.992389396183491  1.6)
    ( 0.34862297099063 3.984778792366982  1.6)
    ( 1.035276180410083 3.863703305156273 1.6)
    ( 0.51763809020504 1.931851652578137  1.6)
    (-0.51763809020504 1.931851652578137  2)
    (-1.035276180410083 3.863703305156273 2)
    (-0.34862297099063 3.984778792366982  2)
    (-0.17431148549532 1.992389396183491  2)
    ( 0.17431148549532 1.992389396183491  2)
    ( 0.34862297099063 3.984778792366982  2)
    ( 1.035276180410083 3.863703305156273 2)
    ( 0.51763809020504 1.931851652578137  2)
    (-0.34862297099063 3.984778792366982  1.6)
    (-0.17431148549532 1.992389396183491  1.6)
    ( 0.17431148549532 1.992389396183491  1.6)
    ( 0.34862297099063 3.984778792366982  1.6)
);

blocks
(
    hex (0 3 2 1  8 11 10  9) (15 40 30) simpleGrading (1 1 1)
    hex (3 4 5 2 11 12 13 10) (15 40 30) simpleGrading (1 1 1)
    hex (4 7 6 5 12 15 14 13) (15 40 30) simpleGrading (1 1 1)

    hex (16 19 18  17 24 27 26 25) (15 40 10) simpleGrading (1 1 1)
    hex (19 20 21 18 27 28 29 26 ) (15 40 10) simpleGrading (1 1 1)
    hex (20 23 22 21 28 31 30 29 ) (15 40 10) simpleGrading (1 1 1)

    hex (24 27 26 25 32 35 34 33) (15 40 10) simpleGrading (1 1 1)

    hex (28 31 30 29 36 39 38 37 ) (15 40 10) simpleGrading (1 1 1)

    hex (32 35 34 33 40 43 42 41) (15 40 10) simpleGrading (1 1 1)

    hex (36 39 38 37 44 47 46 45 ) (15 40 10) simpleGrading (1 1 1)
);


edges
(
   arc 0 3 ( -0.34729635533386 1.969615506024416  0 )
   arc 2 1 ( -0.69459271066772 3.939231012048832  0 )
   arc 3 4 ( 0 2 0)
   arc 5 2 ( 0 4 0)
   arc 4 7 ( 0.34729635533386 1.969615506024416  0 )
   arc 6 5 ( 0.69459271066772 3.939231012048832  0 )

   arc 40 43 ( -0.34729635533386 1.969615506024416  2 )
   arc 42 41 ( -0.69459271066772 3.939231012048832  2 )

   arc 44 47 ( 0.34729635533386 1.969615506024416  2 )
   arc 46 45 ( 0.69459271066772 3.939231012048832  2 )

   arc 32 35 ( -0.34729635533386 1.969615506024416  1.6 )
   arc 34 33 ( -0.69459271066772 3.939231012048832  1.6 )

   arc 36 39 ( 0.34729635533386 1.969615506024416  1.6 )
   arc 38 37 ( 0.69459271066772 3.939231012048832  1.6 )


   arc 24 27 ( -0.34729635533386 1.969615506024416  1.3 )
   arc 26 25 ( -0.69459271066772 3.939231012048832  1.3 )
   arc 27 28 ( 0 2 1.3)
   arc 29 26 ( 0 4 1.3)
   arc 28 31 ( 0.34729635533386 1.969615506024416  1.3 )
   arc 30 29 ( 0.69459271066772 3.939231012048832  1.3 )


   arc 8 11 ( -0.34729635533386 1.969615506024416  1 )
   arc 10 9 ( -0.69459271066772 3.939231012048832  1 )
   arc 11 12 ( 0 2 1)
   arc 13 10 ( 0 4 1)
   arc 12 15 ( 0.34729635533386 1.969615506024416  1 )
   arc 14 13 ( 0.69459271066772 3.939231012048832  1 )

   arc 16 19 ( -0.34729635533386 1.969615506024416  1 )
   arc 18 17 ( -0.69459271066772 3.939231012048832  1 )
   arc 19 20 ( 0 2 1)
   arc 21 18 ( 0 4 1)
   arc 20 23 ( 0.34729635533386 1.969615506024416  1 )
   arc 22 21 ( 0.69459271066772 3.939231012048832  1 )

);

patches
(
    patch Half 
    ( 
       ( 0 3 2 1)
       ( 4 7 6 5)
    )
    
    patch Full 
    (
        (3 4 5 2)
    ) 
    mixingPlane master
    ( 
      ( 8 9 10 11 )
      ( 11 10 13 12 )
      ( 12 13 14 15 )
    )

    mixingPlane slave
    (
      ( 16 19 18  17 )
      ( 19 20 21 18 )
      ( 20 23 22 21 )
    )

    patch Back
    (
      ( 40 43 42 41 )
      ( 44 47 46 45 )
    )

    patch Solid
    (
      ( 27 28 29 26 )
      ( 27 26 34 35)
      ( 35 34 42 43)
      ( 36 44 45 37)
      ( 28 36 37 29)

    )

    patch Rest
    (       
       (1 2 10  9)
       (10 2 5 13)
       (13 5 6 14)
       (14 6 7 15)
       (15 7 4 12)
       (4 3 11 12)
       (3 0  8 11)
       (1 9 8 0 )  
       (17 18 26 25)     
       (26 18 21 29)
       (29 21 22 30)
       (30 22 23 31)
       (31 23 20 28) 
       (20 19 27 28)
       (19 16  24 27)
       (17 25 24 16)  
       ( 27 24 32 35)
       ( 31 28 36 39)
       ( 37 29 30 38)
       ( 24 25 33 32)
       ( 31 30 38 39)       
       ( 33 25 26 34)
       (33 34 42 41)       
       (45 37 38 46)
       (46 38 39 47)
       (47 39 36 44)
       (35 32 40 43)
       (33 41 40 32) 
    )
);


