Breeder/OSIG/TurboMachinery/tutorials/rotorStatorInterfaces/mixingPlane/noRotationRS/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Half      
    {
        type            fixedValue;
        value           uniform (0 0 0.5);
    }

    Full      
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    Solid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    Back    
    {
        type            zeroGradient;
    }

    slave    
    {
        type            mixingPlaneFvPatchField;
        zeroGradient    false;    
    }
    
    master    
    {
        type            mixingPlaneFvPatchField; 
        zeroGradient    true;    
    }

    Rest
    {	
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
